name: "ResNet-269"

mem_param { optimize_test: true }
####################################### data #######################################
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 700
  dim: 700
}

input: "rois"
input_shape {
  dim: 150
  dim: 5
}


layer {
  name: "caffe.SpatialConvolution_0"
  type: "Convolution"
  bottom: "data"
  top: "caffe.SpatialConvolution_0"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 3
    pad_w: 3
    kernel_h: 7
    kernel_w: 7
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_1"
  type: "BN"
  bottom: "caffe.SpatialConvolution_0"
  top: "caffe.BN_1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_2"
  type: "ReLU"
  bottom: "caffe.BN_1"
  top: "caffe.BN_1"
}
layer {
  name: "caffe.Pooling_3"
  type: "Pooling"
  bottom: "caffe.BN_1"
  top: "caffe.Pooling_3"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "caffe.SpatialConvolution_4"
  type: "Convolution"
  bottom: "caffe.Pooling_3"
  top: "caffe.SpatialConvolution_4"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_5"
  type: "BN"
  bottom: "caffe.SpatialConvolution_4"
  top: "caffe.BN_5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_6"
  type: "ReLU"
  bottom: "caffe.BN_5"
  top: "caffe.BN_5"
}
layer {
  name: "caffe.SpatialConvolution_7"
  type: "Convolution"
  bottom: "caffe.BN_5"
  top: "caffe.SpatialConvolution_7"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_8"
  type: "BN"
  bottom: "caffe.SpatialConvolution_7"
  top: "caffe.BN_8"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_9"
  type: "ReLU"
  bottom: "caffe.BN_8"
  top: "caffe.BN_8"
}
layer {
  name: "caffe.SpatialConvolution_10"
  type: "Convolution"
  bottom: "caffe.BN_8"
  top: "caffe.SpatialConvolution_10"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.SpatialConvolution_11"
  type: "Convolution"
  bottom: "caffe.Pooling_3"
  top: "caffe.SpatialConvolution_11"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_12"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_10"
  bottom: "caffe.SpatialConvolution_11"
  top: "caffe.Eltwise_12"
}
layer {
  name: "caffe.BN_13"
  type: "BN"
  bottom: "caffe.Eltwise_12"
  top: "caffe.BN_13"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_14"
  type: "ReLU"
  bottom: "caffe.BN_13"
  top: "caffe.BN_13"
}
layer {
  name: "caffe.SpatialConvolution_15"
  type: "Convolution"
  bottom: "caffe.BN_13"
  top: "caffe.SpatialConvolution_15"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_16"
  type: "BN"
  bottom: "caffe.SpatialConvolution_15"
  top: "caffe.BN_16"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_17"
  type: "ReLU"
  bottom: "caffe.BN_16"
  top: "caffe.BN_16"
}
layer {
  name: "caffe.SpatialConvolution_18"
  type: "Convolution"
  bottom: "caffe.BN_16"
  top: "caffe.SpatialConvolution_18"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_19"
  type: "BN"
  bottom: "caffe.SpatialConvolution_18"
  top: "caffe.BN_19"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_20"
  type: "ReLU"
  bottom: "caffe.BN_19"
  top: "caffe.BN_19"
}
layer {
  name: "caffe.SpatialConvolution_21"
  type: "Convolution"
  bottom: "caffe.BN_19"
  top: "caffe.SpatialConvolution_21"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_22"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_21"
  bottom: "caffe.Eltwise_12"
  top: "caffe.Eltwise_22"
}
layer {
  name: "caffe.BN_23"
  type: "BN"
  bottom: "caffe.Eltwise_22"
  top: "caffe.BN_23"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_24"
  type: "ReLU"
  bottom: "caffe.BN_23"
  top: "caffe.BN_23"
}
layer {
  name: "caffe.SpatialConvolution_25"
  type: "Convolution"
  bottom: "caffe.BN_23"
  top: "caffe.SpatialConvolution_25"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_26"
  type: "BN"
  bottom: "caffe.SpatialConvolution_25"
  top: "caffe.BN_26"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_27"
  type: "ReLU"
  bottom: "caffe.BN_26"
  top: "caffe.BN_26"
}
layer {
  name: "caffe.SpatialConvolution_28"
  type: "Convolution"
  bottom: "caffe.BN_26"
  top: "caffe.SpatialConvolution_28"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_29"
  type: "BN"
  bottom: "caffe.SpatialConvolution_28"
  top: "caffe.BN_29"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_30"
  type: "ReLU"
  bottom: "caffe.BN_29"
  top: "caffe.BN_29"
}
layer {
  name: "caffe.SpatialConvolution_31"
  type: "Convolution"
  bottom: "caffe.BN_29"
  top: "caffe.SpatialConvolution_31"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_32"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_31"
  bottom: "caffe.Eltwise_22"
  top: "caffe.Eltwise_32"
}
layer {
  name: "caffe.BN_33"
  type: "BN"
  bottom: "caffe.Eltwise_32"
  top: "caffe.BN_33"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_34"
  type: "ReLU"
  bottom: "caffe.BN_33"
  top: "caffe.BN_33"
}
layer {
  name: "caffe.SpatialConvolution_35"
  type: "Convolution"
  bottom: "caffe.BN_33"
  top: "caffe.SpatialConvolution_35"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_36"
  type: "BN"
  bottom: "caffe.SpatialConvolution_35"
  top: "caffe.BN_36"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_37"
  type: "ReLU"
  bottom: "caffe.BN_36"
  top: "caffe.BN_36"
}
layer {
  name: "caffe.SpatialConvolution_38"
  type: "Convolution"
  bottom: "caffe.BN_36"
  top: "caffe.SpatialConvolution_38"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_39"
  type: "BN"
  bottom: "caffe.SpatialConvolution_38"
  top: "caffe.BN_39"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_40"
  type: "ReLU"
  bottom: "caffe.BN_39"
  top: "caffe.BN_39"
}
layer {
  name: "caffe.SpatialConvolution_41"
  type: "Convolution"
  bottom: "caffe.BN_39"
  top: "caffe.SpatialConvolution_41"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.SpatialConvolution_42"
  type: "Convolution"
  bottom: "caffe.BN_33"
  top: "caffe.SpatialConvolution_42"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.Eltwise_43"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_41"
  bottom: "caffe.SpatialConvolution_42"
  top: "caffe.Eltwise_43"
}
layer {
  name: "caffe.BN_44"
  type: "BN"
  bottom: "caffe.Eltwise_43"
  top: "caffe.BN_44"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_45"
  type: "ReLU"
  bottom: "caffe.BN_44"
  top: "caffe.BN_44"
}
layer {
  name: "caffe.SpatialConvolution_46"
  type: "Convolution"
  bottom: "caffe.BN_44"
  top: "caffe.SpatialConvolution_46"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_47"
  type: "BN"
  bottom: "caffe.SpatialConvolution_46"
  top: "caffe.BN_47"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_48"
  type: "ReLU"
  bottom: "caffe.BN_47"
  top: "caffe.BN_47"
}
layer {
  name: "caffe.SpatialConvolution_49"
  type: "Convolution"
  bottom: "caffe.BN_47"
  top: "caffe.SpatialConvolution_49"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_50"
  type: "BN"
  bottom: "caffe.SpatialConvolution_49"
  top: "caffe.BN_50"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_51"
  type: "ReLU"
  bottom: "caffe.BN_50"
  top: "caffe.BN_50"
}
layer {
  name: "caffe.SpatialConvolution_52"
  type: "Convolution"
  bottom: "caffe.BN_50"
  top: "caffe.SpatialConvolution_52"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_53"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_52"
  bottom: "caffe.Eltwise_43"
  top: "caffe.Eltwise_53"
}
layer {
  name: "caffe.BN_54"
  type: "BN"
  bottom: "caffe.Eltwise_53"
  top: "caffe.BN_54"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_55"
  type: "ReLU"
  bottom: "caffe.BN_54"
  top: "caffe.BN_54"
}
layer {
  name: "caffe.SpatialConvolution_56"
  type: "Convolution"
  bottom: "caffe.BN_54"
  top: "caffe.SpatialConvolution_56"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_57"
  type: "BN"
  bottom: "caffe.SpatialConvolution_56"
  top: "caffe.BN_57"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_58"
  type: "ReLU"
  bottom: "caffe.BN_57"
  top: "caffe.BN_57"
}
layer {
  name: "caffe.SpatialConvolution_59"
  type: "Convolution"
  bottom: "caffe.BN_57"
  top: "caffe.SpatialConvolution_59"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_60"
  type: "BN"
  bottom: "caffe.SpatialConvolution_59"
  top: "caffe.BN_60"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_61"
  type: "ReLU"
  bottom: "caffe.BN_60"
  top: "caffe.BN_60"
}
layer {
  name: "caffe.SpatialConvolution_62"
  type: "Convolution"
  bottom: "caffe.BN_60"
  top: "caffe.SpatialConvolution_62"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_63"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_62"
  bottom: "caffe.Eltwise_53"
  top: "caffe.Eltwise_63"
}
layer {
  name: "caffe.BN_64"
  type: "BN"
  bottom: "caffe.Eltwise_63"
  top: "caffe.BN_64"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_65"
  type: "ReLU"
  bottom: "caffe.BN_64"
  top: "caffe.BN_64"
}
layer {
  name: "caffe.SpatialConvolution_66"
  type: "Convolution"
  bottom: "caffe.BN_64"
  top: "caffe.SpatialConvolution_66"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_67"
  type: "BN"
  bottom: "caffe.SpatialConvolution_66"
  top: "caffe.BN_67"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_68"
  type: "ReLU"
  bottom: "caffe.BN_67"
  top: "caffe.BN_67"
}
layer {
  name: "caffe.SpatialConvolution_69"
  type: "Convolution"
  bottom: "caffe.BN_67"
  top: "caffe.SpatialConvolution_69"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_70"
  type: "BN"
  bottom: "caffe.SpatialConvolution_69"
  top: "caffe.BN_70"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_71"
  type: "ReLU"
  bottom: "caffe.BN_70"
  top: "caffe.BN_70"
}
layer {
  name: "caffe.SpatialConvolution_72"
  type: "Convolution"
  bottom: "caffe.BN_70"
  top: "caffe.SpatialConvolution_72"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_73"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_72"
  bottom: "caffe.Eltwise_63"
  top: "caffe.Eltwise_73"
}
layer {
  name: "caffe.BN_74"
  type: "BN"
  bottom: "caffe.Eltwise_73"
  top: "caffe.BN_74"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_75"
  type: "ReLU"
  bottom: "caffe.BN_74"
  top: "caffe.BN_74"
}
layer {
  name: "caffe.SpatialConvolution_76"
  type: "Convolution"
  bottom: "caffe.BN_74"
  top: "caffe.SpatialConvolution_76"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_77"
  type: "BN"
  bottom: "caffe.SpatialConvolution_76"
  top: "caffe.BN_77"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_78"
  type: "ReLU"
  bottom: "caffe.BN_77"
  top: "caffe.BN_77"
}
layer {
  name: "caffe.SpatialConvolution_79"
  type: "Convolution"
  bottom: "caffe.BN_77"
  top: "caffe.SpatialConvolution_79"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_80"
  type: "BN"
  bottom: "caffe.SpatialConvolution_79"
  top: "caffe.BN_80"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_81"
  type: "ReLU"
  bottom: "caffe.BN_80"
  top: "caffe.BN_80"
}
layer {
  name: "caffe.SpatialConvolution_82"
  type: "Convolution"
  bottom: "caffe.BN_80"
  top: "caffe.SpatialConvolution_82"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_83"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_82"
  bottom: "caffe.Eltwise_73"
  top: "caffe.Eltwise_83"
}
layer {
  name: "caffe.BN_84"
  type: "BN"
  bottom: "caffe.Eltwise_83"
  top: "caffe.BN_84"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_85"
  type: "ReLU"
  bottom: "caffe.BN_84"
  top: "caffe.BN_84"
}
layer {
  name: "caffe.SpatialConvolution_86"
  type: "Convolution"
  bottom: "caffe.BN_84"
  top: "caffe.SpatialConvolution_86"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_87"
  type: "BN"
  bottom: "caffe.SpatialConvolution_86"
  top: "caffe.BN_87"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_88"
  type: "ReLU"
  bottom: "caffe.BN_87"
  top: "caffe.BN_87"
}
layer {
  name: "caffe.SpatialConvolution_89"
  type: "Convolution"
  bottom: "caffe.BN_87"
  top: "caffe.SpatialConvolution_89"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_90"
  type: "BN"
  bottom: "caffe.SpatialConvolution_89"
  top: "caffe.BN_90"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_91"
  type: "ReLU"
  bottom: "caffe.BN_90"
  top: "caffe.BN_90"
}
layer {
  name: "caffe.SpatialConvolution_92"
  type: "Convolution"
  bottom: "caffe.BN_90"
  top: "caffe.SpatialConvolution_92"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_93"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_92"
  bottom: "caffe.Eltwise_83"
  top: "caffe.Eltwise_93"
}
layer {
  name: "caffe.BN_94"
  type: "BN"
  bottom: "caffe.Eltwise_93"
  top: "caffe.BN_94"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_95"
  type: "ReLU"
  bottom: "caffe.BN_94"
  top: "caffe.BN_94"
}
layer {
  name: "caffe.SpatialConvolution_96"
  type: "Convolution"
  bottom: "caffe.BN_94"
  top: "caffe.SpatialConvolution_96"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_97"
  type: "BN"
  bottom: "caffe.SpatialConvolution_96"
  top: "caffe.BN_97"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_98"
  type: "ReLU"
  bottom: "caffe.BN_97"
  top: "caffe.BN_97"
}
layer {
  name: "caffe.SpatialConvolution_99"
  type: "Convolution"
  bottom: "caffe.BN_97"
  top: "caffe.SpatialConvolution_99"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_100"
  type: "BN"
  bottom: "caffe.SpatialConvolution_99"
  top: "caffe.BN_100"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_101"
  type: "ReLU"
  bottom: "caffe.BN_100"
  top: "caffe.BN_100"
}
layer {
  name: "caffe.SpatialConvolution_102"
  type: "Convolution"
  bottom: "caffe.BN_100"
  top: "caffe.SpatialConvolution_102"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_103"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_102"
  bottom: "caffe.Eltwise_93"
  top: "caffe.Eltwise_103"
}
layer {
  name: "caffe.BN_104"
  type: "BN"
  bottom: "caffe.Eltwise_103"
  top: "caffe.BN_104"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_105"
  type: "ReLU"
  bottom: "caffe.BN_104"
  top: "caffe.BN_104"
}
layer {
  name: "caffe.SpatialConvolution_106"
  type: "Convolution"
  bottom: "caffe.BN_104"
  top: "caffe.SpatialConvolution_106"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_107"
  type: "BN"
  bottom: "caffe.SpatialConvolution_106"
  top: "caffe.BN_107"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_108"
  type: "ReLU"
  bottom: "caffe.BN_107"
  top: "caffe.BN_107"
}
layer {
  name: "caffe.SpatialConvolution_109"
  type: "Convolution"
  bottom: "caffe.BN_107"
  top: "caffe.SpatialConvolution_109"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_110"
  type: "BN"
  bottom: "caffe.SpatialConvolution_109"
  top: "caffe.BN_110"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_111"
  type: "ReLU"
  bottom: "caffe.BN_110"
  top: "caffe.BN_110"
}
layer {
  name: "caffe.SpatialConvolution_112"
  type: "Convolution"
  bottom: "caffe.BN_110"
  top: "caffe.SpatialConvolution_112"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_113"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_112"
  bottom: "caffe.Eltwise_103"
  top: "caffe.Eltwise_113"
}
layer {
  name: "caffe.BN_114"
  type: "BN"
  bottom: "caffe.Eltwise_113"
  top: "caffe.BN_114"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_115"
  type: "ReLU"
  bottom: "caffe.BN_114"
  top: "caffe.BN_114"
}
layer {
  name: "caffe.SpatialConvolution_116"
  type: "Convolution"
  bottom: "caffe.BN_114"
  top: "caffe.SpatialConvolution_116"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_117"
  type: "BN"
  bottom: "caffe.SpatialConvolution_116"
  top: "caffe.BN_117"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_118"
  type: "ReLU"
  bottom: "caffe.BN_117"
  top: "caffe.BN_117"
}
layer {
  name: "caffe.SpatialConvolution_119"
  type: "Convolution"
  bottom: "caffe.BN_117"
  top: "caffe.SpatialConvolution_119"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_120"
  type: "BN"
  bottom: "caffe.SpatialConvolution_119"
  top: "caffe.BN_120"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_121"
  type: "ReLU"
  bottom: "caffe.BN_120"
  top: "caffe.BN_120"
}
layer {
  name: "caffe.SpatialConvolution_122"
  type: "Convolution"
  bottom: "caffe.BN_120"
  top: "caffe.SpatialConvolution_122"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_123"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_122"
  bottom: "caffe.Eltwise_113"
  top: "caffe.Eltwise_123"
}
layer {
  name: "caffe.BN_124"
  type: "BN"
  bottom: "caffe.Eltwise_123"
  top: "caffe.BN_124"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_125"
  type: "ReLU"
  bottom: "caffe.BN_124"
  top: "caffe.BN_124"
}
layer {
  name: "caffe.SpatialConvolution_126"
  type: "Convolution"
  bottom: "caffe.BN_124"
  top: "caffe.SpatialConvolution_126"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_127"
  type: "BN"
  bottom: "caffe.SpatialConvolution_126"
  top: "caffe.BN_127"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_128"
  type: "ReLU"
  bottom: "caffe.BN_127"
  top: "caffe.BN_127"
}
layer {
  name: "caffe.SpatialConvolution_129"
  type: "Convolution"
  bottom: "caffe.BN_127"
  top: "caffe.SpatialConvolution_129"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_130"
  type: "BN"
  bottom: "caffe.SpatialConvolution_129"
  top: "caffe.BN_130"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_131"
  type: "ReLU"
  bottom: "caffe.BN_130"
  top: "caffe.BN_130"
}
layer {
  name: "caffe.SpatialConvolution_132"
  type: "Convolution"
  bottom: "caffe.BN_130"
  top: "caffe.SpatialConvolution_132"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_133"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_132"
  bottom: "caffe.Eltwise_123"
  top: "caffe.Eltwise_133"
}
layer {
  name: "caffe.BN_134"
  type: "BN"
  bottom: "caffe.Eltwise_133"
  top: "caffe.BN_134"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_135"
  type: "ReLU"
  bottom: "caffe.BN_134"
  top: "caffe.BN_134"
}
layer {
  name: "caffe.SpatialConvolution_136"
  type: "Convolution"
  bottom: "caffe.BN_134"
  top: "caffe.SpatialConvolution_136"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_137"
  type: "BN"
  bottom: "caffe.SpatialConvolution_136"
  top: "caffe.BN_137"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_138"
  type: "ReLU"
  bottom: "caffe.BN_137"
  top: "caffe.BN_137"
}
layer {
  name: "caffe.SpatialConvolution_139"
  type: "Convolution"
  bottom: "caffe.BN_137"
  top: "caffe.SpatialConvolution_139"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_140"
  type: "BN"
  bottom: "caffe.SpatialConvolution_139"
  top: "caffe.BN_140"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_141"
  type: "ReLU"
  bottom: "caffe.BN_140"
  top: "caffe.BN_140"
}
layer {
  name: "caffe.SpatialConvolution_142"
  type: "Convolution"
  bottom: "caffe.BN_140"
  top: "caffe.SpatialConvolution_142"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_143"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_142"
  bottom: "caffe.Eltwise_133"
  top: "caffe.Eltwise_143"
}
layer {
  name: "caffe.BN_144"
  type: "BN"
  bottom: "caffe.Eltwise_143"
  top: "caffe.BN_144"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_145"
  type: "ReLU"
  bottom: "caffe.BN_144"
  top: "caffe.BN_144"
}
layer {
  name: "caffe.SpatialConvolution_146"
  type: "Convolution"
  bottom: "caffe.BN_144"
  top: "caffe.SpatialConvolution_146"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_147"
  type: "BN"
  bottom: "caffe.SpatialConvolution_146"
  top: "caffe.BN_147"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_148"
  type: "ReLU"
  bottom: "caffe.BN_147"
  top: "caffe.BN_147"
}
layer {
  name: "caffe.SpatialConvolution_149"
  type: "Convolution"
  bottom: "caffe.BN_147"
  top: "caffe.SpatialConvolution_149"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_150"
  type: "BN"
  bottom: "caffe.SpatialConvolution_149"
  top: "caffe.BN_150"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_151"
  type: "ReLU"
  bottom: "caffe.BN_150"
  top: "caffe.BN_150"
}
layer {
  name: "caffe.SpatialConvolution_152"
  type: "Convolution"
  bottom: "caffe.BN_150"
  top: "caffe.SpatialConvolution_152"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_153"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_152"
  bottom: "caffe.Eltwise_143"
  top: "caffe.Eltwise_153"
}
layer {
  name: "caffe.BN_154"
  type: "BN"
  bottom: "caffe.Eltwise_153"
  top: "caffe.BN_154"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_155"
  type: "ReLU"
  bottom: "caffe.BN_154"
  top: "caffe.BN_154"
}
layer {
  name: "caffe.SpatialConvolution_156"
  type: "Convolution"
  bottom: "caffe.BN_154"
  top: "caffe.SpatialConvolution_156"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_157"
  type: "BN"
  bottom: "caffe.SpatialConvolution_156"
  top: "caffe.BN_157"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_158"
  type: "ReLU"
  bottom: "caffe.BN_157"
  top: "caffe.BN_157"
}
layer {
  name: "caffe.SpatialConvolution_159"
  type: "Convolution"
  bottom: "caffe.BN_157"
  top: "caffe.SpatialConvolution_159"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_160"
  type: "BN"
  bottom: "caffe.SpatialConvolution_159"
  top: "caffe.BN_160"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_161"
  type: "ReLU"
  bottom: "caffe.BN_160"
  top: "caffe.BN_160"
}
layer {
  name: "caffe.SpatialConvolution_162"
  type: "Convolution"
  bottom: "caffe.BN_160"
  top: "caffe.SpatialConvolution_162"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_163"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_162"
  bottom: "caffe.Eltwise_153"
  top: "caffe.Eltwise_163"
}
layer {
  name: "caffe.BN_164"
  type: "BN"
  bottom: "caffe.Eltwise_163"
  top: "caffe.BN_164"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_165"
  type: "ReLU"
  bottom: "caffe.BN_164"
  top: "caffe.BN_164"
}
layer {
  name: "caffe.SpatialConvolution_166"
  type: "Convolution"
  bottom: "caffe.BN_164"
  top: "caffe.SpatialConvolution_166"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_167"
  type: "BN"
  bottom: "caffe.SpatialConvolution_166"
  top: "caffe.BN_167"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_168"
  type: "ReLU"
  bottom: "caffe.BN_167"
  top: "caffe.BN_167"
}
layer {
  name: "caffe.SpatialConvolution_169"
  type: "Convolution"
  bottom: "caffe.BN_167"
  top: "caffe.SpatialConvolution_169"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_170"
  type: "BN"
  bottom: "caffe.SpatialConvolution_169"
  top: "caffe.BN_170"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_171"
  type: "ReLU"
  bottom: "caffe.BN_170"
  top: "caffe.BN_170"
}
layer {
  name: "caffe.SpatialConvolution_172"
  type: "Convolution"
  bottom: "caffe.BN_170"
  top: "caffe.SpatialConvolution_172"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_173"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_172"
  bottom: "caffe.Eltwise_163"
  top: "caffe.Eltwise_173"
}
layer {
  name: "caffe.BN_174"
  type: "BN"
  bottom: "caffe.Eltwise_173"
  top: "caffe.BN_174"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_175"
  type: "ReLU"
  bottom: "caffe.BN_174"
  top: "caffe.BN_174"
}
layer {
  name: "caffe.SpatialConvolution_176"
  type: "Convolution"
  bottom: "caffe.BN_174"
  top: "caffe.SpatialConvolution_176"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_177"
  type: "BN"
  bottom: "caffe.SpatialConvolution_176"
  top: "caffe.BN_177"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_178"
  type: "ReLU"
  bottom: "caffe.BN_177"
  top: "caffe.BN_177"
}
layer {
  name: "caffe.SpatialConvolution_179"
  type: "Convolution"
  bottom: "caffe.BN_177"
  top: "caffe.SpatialConvolution_179"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_180"
  type: "BN"
  bottom: "caffe.SpatialConvolution_179"
  top: "caffe.BN_180"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_181"
  type: "ReLU"
  bottom: "caffe.BN_180"
  top: "caffe.BN_180"
}
layer {
  name: "caffe.SpatialConvolution_182"
  type: "Convolution"
  bottom: "caffe.BN_180"
  top: "caffe.SpatialConvolution_182"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_183"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_182"
  bottom: "caffe.Eltwise_173"
  top: "caffe.Eltwise_183"
}
layer {
  name: "caffe.BN_184"
  type: "BN"
  bottom: "caffe.Eltwise_183"
  top: "caffe.BN_184"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_185"
  type: "ReLU"
  bottom: "caffe.BN_184"
  top: "caffe.BN_184"
}
layer {
  name: "caffe.SpatialConvolution_186"
  type: "Convolution"
  bottom: "caffe.BN_184"
  top: "caffe.SpatialConvolution_186"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_187"
  type: "BN"
  bottom: "caffe.SpatialConvolution_186"
  top: "caffe.BN_187"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_188"
  type: "ReLU"
  bottom: "caffe.BN_187"
  top: "caffe.BN_187"
}
layer {
  name: "caffe.SpatialConvolution_189"
  type: "Convolution"
  bottom: "caffe.BN_187"
  top: "caffe.SpatialConvolution_189"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_190"
  type: "BN"
  bottom: "caffe.SpatialConvolution_189"
  top: "caffe.BN_190"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_191"
  type: "ReLU"
  bottom: "caffe.BN_190"
  top: "caffe.BN_190"
}
layer {
  name: "caffe.SpatialConvolution_192"
  type: "Convolution"
  bottom: "caffe.BN_190"
  top: "caffe.SpatialConvolution_192"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_193"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_192"
  bottom: "caffe.Eltwise_183"
  top: "caffe.Eltwise_193"
}
layer {
  name: "caffe.BN_194"
  type: "BN"
  bottom: "caffe.Eltwise_193"
  top: "caffe.BN_194"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_195"
  type: "ReLU"
  bottom: "caffe.BN_194"
  top: "caffe.BN_194"
}
layer {
  name: "caffe.SpatialConvolution_196"
  type: "Convolution"
  bottom: "caffe.BN_194"
  top: "caffe.SpatialConvolution_196"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_197"
  type: "BN"
  bottom: "caffe.SpatialConvolution_196"
  top: "caffe.BN_197"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_198"
  type: "ReLU"
  bottom: "caffe.BN_197"
  top: "caffe.BN_197"
}
layer {
  name: "caffe.SpatialConvolution_199"
  type: "Convolution"
  bottom: "caffe.BN_197"
  top: "caffe.SpatialConvolution_199"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_200"
  type: "BN"
  bottom: "caffe.SpatialConvolution_199"
  top: "caffe.BN_200"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_201"
  type: "ReLU"
  bottom: "caffe.BN_200"
  top: "caffe.BN_200"
}
layer {
  name: "caffe.SpatialConvolution_202"
  type: "Convolution"
  bottom: "caffe.BN_200"
  top: "caffe.SpatialConvolution_202"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_203"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_202"
  bottom: "caffe.Eltwise_193"
  top: "caffe.Eltwise_203"
}
layer {
  name: "caffe.BN_204"
  type: "BN"
  bottom: "caffe.Eltwise_203"
  top: "caffe.BN_204"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_205"
  type: "ReLU"
  bottom: "caffe.BN_204"
  top: "caffe.BN_204"
}
layer {
  name: "caffe.SpatialConvolution_206"
  type: "Convolution"
  bottom: "caffe.BN_204"
  top: "caffe.SpatialConvolution_206"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_207"
  type: "BN"
  bottom: "caffe.SpatialConvolution_206"
  top: "caffe.BN_207"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_208"
  type: "ReLU"
  bottom: "caffe.BN_207"
  top: "caffe.BN_207"
}
layer {
  name: "caffe.SpatialConvolution_209"
  type: "Convolution"
  bottom: "caffe.BN_207"
  top: "caffe.SpatialConvolution_209"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_210"
  type: "BN"
  bottom: "caffe.SpatialConvolution_209"
  top: "caffe.BN_210"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_211"
  type: "ReLU"
  bottom: "caffe.BN_210"
  top: "caffe.BN_210"
}
layer {
  name: "caffe.SpatialConvolution_212"
  type: "Convolution"
  bottom: "caffe.BN_210"
  top: "caffe.SpatialConvolution_212"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_213"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_212"
  bottom: "caffe.Eltwise_203"
  top: "caffe.Eltwise_213"
}
layer {
  name: "caffe.BN_214"
  type: "BN"
  bottom: "caffe.Eltwise_213"
  top: "caffe.BN_214"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_215"
  type: "ReLU"
  bottom: "caffe.BN_214"
  top: "caffe.BN_214"
}
layer {
  name: "caffe.SpatialConvolution_216"
  type: "Convolution"
  bottom: "caffe.BN_214"
  top: "caffe.SpatialConvolution_216"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_217"
  type: "BN"
  bottom: "caffe.SpatialConvolution_216"
  top: "caffe.BN_217"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_218"
  type: "ReLU"
  bottom: "caffe.BN_217"
  top: "caffe.BN_217"
}
layer {
  name: "caffe.SpatialConvolution_219"
  type: "Convolution"
  bottom: "caffe.BN_217"
  top: "caffe.SpatialConvolution_219"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_220"
  type: "BN"
  bottom: "caffe.SpatialConvolution_219"
  top: "caffe.BN_220"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param { frozen: true
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_221"
  type: "ReLU"
  bottom: "caffe.BN_220"
  top: "caffe.BN_220"
}
layer {
